---
title: "CREATE A DATAFRAME FROM LISTS"
author: "Rakshmitha"
date: 2020-08-13
description: "-"
type: technical_note
draft: false
---

## Create a DataFrame from Lists
The DataFrame can be created using a single list or a list of lists.

In [1]:
import pandas as pd

In [2]:
data = [1,2,3,4,5]
df = pd.DataFrame(data)

In [4]:
df

   0
0  1
1  2
2  3
3  4
4  5

In [5]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])

In [6]:
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [7]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)

In [8]:
df

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

the dtype parameter changes the type of Age column to floating point.